const React = require('react');
const Content = require('./Content.jsx');

class MainContent extends Content {
    constructor(props) {
        super(props);
    }
    
    render() {console.log('main');
        return (
            <div className={((this.state.visibility)?'visibility':'hiden') + ' content'} >
                <h1>Здравствуйте</h1>
                <p>Приветсвую Вас на сайте, который явлеется моим резюме.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Так же, я счетаю, что если брать человека в команду, важна и его личностная составляющая.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
                <p>Здесь я расскажу о своей рабочей деятельности. О том какими технологиями я пользуюсь. В каких проектах учавствовал.</p>
            </div>
            );
    }
}

module.exports = MainContent;